Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::v1::FlexibleSegment Class Referencefinal
MEP Element Manager
In contrast to rigid segments flexible duct is not a connection of multiple elements (straight segments and bends), instead a type of ducting pipe that could easily be bent in different angles. More...
#include <MEPFlexibleSegment.hpp>
 Inheritance diagram for ACAPI::MEP::v1::FlexibleSegment:
 Public Member Functions
FlexibleSegmentDefault  | PickUpDefault () const
Picks up the Default from the FlexibleSegment.
double  | GetWidth () const
double  | GetHeight () const
std::vector< API_Coord3D >  | GetControlPoints () const
Domain  | GetDomain () const
Returns the domain of the FlexibleSegment.
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
Result< void >  | Inject (const FlexibleSegmentDefault &flexibleSegmentDefault)
Injects the Default settings into the FlexibleSegment.
void  | SetControlPoints (const std::vector< API_Coord3D > &points)
Sets the control points of the FlexibleSegment.
Result< void >  | SetWidth (double width)
Sets the width of the FlexibleSegment.
Result< void >  | SetHeight (double height)
Sets the height of the FlexibleSegment.
 Public Member Functions inherited from ACAPI::MEP::v1::ModifiableElementBase
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetAnchorPoint (const API_Coord3D &anchorPoint)
Sets the anchor point of the ModifiableElement.
void  | SetOrientation (const MEP::Orientation &orientation)
Sets the orientation of the ModifiableElement.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ModifiableElement.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Static Public Member Functions
static Result< FlexibleSegment >  | Get (const UniqueID &uniqueId)
Returns a FlexibleSegment.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::ModifiableElementBase
ModifiableElementBase (std::shared_ptr< Impl::IElementBaseImpl >)
Modifier (ModifiableElementBase &)
 void  | FinalizeModification () override
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl >)
Detailed Description
In contrast to rigid segments flexible duct is not a connection of multiple elements (straight segments and bends), instead a type of ducting pipe that could easily be bent in different angles.
Since
Archicad 27
Example code snippet from Test / New MEP
Getters
 ACAPI::Result<FlexibleSegment> flexibleSegment = FlexibleSegment::Get (id);
 if (flexibleSegment.IsErr ()) {
 ACAPI_WriteReport (flexibleSegment.UnwrapErr ().text.c_str (), false);
 return;
 }
 Reporter reporter;
 reporter.SetTabCount (0);
 reporter.Add ("Control points:");
 reporter.SetTabCount (1);
 std::vector<API_Coord3D> controlPoints = flexibleSegment->GetControlPoints ();
 for (const API_Coord3D& controlPoint : controlPoints)
 reporter.Add (ToString (controlPoint));
 reporter.AddNewLine ();
 Modification
 ACAPI::Result<FlexibleSegment> flexibleSegment = FlexibleSegment::Get (id);
 if (flexibleSegment.IsErr ()) {
 ACAPI_WriteReport (flexibleSegment.UnwrapErr ().text.c_str (), false);
 return flexibleSegment.UnwrapErr ().kind;
 }
 std::vector<API_Coord3D> controlPoints = flexibleSegment->GetControlPoints ();
 for (API_Coord3D& controlPoints : controlPoints)
 controlPoints.x += 1.0;
 ACAPI::Result<void> modifyResult = flexibleSegment->Modify ([&](FlexibleSegment::Modifier& modifier) {
 modifier.SetControlPoints (controlPoints);
 }, "Modify the control points of Flexible Segment.");
 return NoError;
Member Function Documentation
◆ Get()
 static Result< FlexibleSegment > ACAPI::MEP::v1::FlexibleSegment::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a FlexibleSegment.
Parameters
uniqueId | The UniqueID of the requested FlexibleSegment.
Returns
If the uniqueId belongs to a FlexibleSegment, returns the object associated to it, otherwise Error.
◆ GetControlPoints()
 std::vector< API_Coord3D > ACAPI::MEP::v1::FlexibleSegment::GetControlPoints  |  ( |   | ) |   const
Returns
Returns the control points of the FlexibleSegment.
◆ GetDomain()
 Domain ACAPI::MEP::v1::FlexibleSegment::GetDomain  |  ( |   | ) |   const
Returns the domain of the FlexibleSegment.
Returns
The returned domain could only be ventilation.
◆ GetHeight()
 double ACAPI::MEP::v1::FlexibleSegment::GetHeight  |  ( |   | ) |   const
Returns
Returns the height of the FlexibleSegment.
◆ GetWidth()
 double ACAPI::MEP::v1::FlexibleSegment::GetWidth  |  ( |   | ) |   const
Returns
Returns the width of the FlexibleSegment.
◆ Inject()
 Result< void > ACAPI::MEP::v1::FlexibleSegment::Inject  |  ( |  const FlexibleSegmentDefault &  |  flexibleSegmentDefault | )
Injects the Default settings into the FlexibleSegment.
Parameters
flexibleSegmentDefault | The Default what will be injected.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::FlexibleSegment::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 FlexibleSegmentDefault ACAPI::MEP::v1::FlexibleSegment::PickUpDefault  |  ( |   | ) |   const
Picks up the Default from the FlexibleSegment.
Returns
Returns a FlexibleSegmentDefault with the parameters of the object it was called for.
◆ SetControlPoints()
 void ACAPI::MEP::v1::FlexibleSegment::SetControlPoints  |  ( |  const std::vector< API_Coord3D > &  |  points | )
Sets the control points of the FlexibleSegment.
Parameters
points | The points to be set.
◆ SetHeight()
 Result< void > ACAPI::MEP::v1::FlexibleSegment::SetHeight  |  ( |  double  |  height | )
Sets the height of the FlexibleSegment.
Parameters
height | The value to be set.
Returns
Returns an error if the height is not positive, otherwise nothing.
◆ SetWidth()
 Result< void > ACAPI::MEP::v1::FlexibleSegment::SetWidth  |  ( |  double  |  width | )
Sets the width of the FlexibleSegment.
Parameters
width | The value to be set.
Returns
Returns an error if the width is not positive, otherwise nothing.